.class public abstract L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;
.super Ljava/lang/Object;
.source "SourceFile"


# static fields
.field public static final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

.field public static final 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

.field public static final 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:D

.field public static final 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:D

.field public static final 뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:D


# direct methods
.method static constructor <clinit>()V
    .locals 6

    .line 1
    const-wide/high16 v0, 0x4000000000000000L    # 2.0

    .line 2
    .line 3
    invoke-static {v0, v1}, Ljava/lang/Math;->log(D)D

    .line 4
    .line 5
    .line 6
    move-result-wide v0

    .line 7
    sput-wide v0, L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 8
    .line 9
    const-wide/high16 v0, 0x3ff0000000000000L    # 1.0

    .line 10
    .line 11
    invoke-static {v0, v1}, Ljava/lang/Math;->ulp(D)D

    .line 12
    .line 13
    .line 14
    move-result-wide v0

    .line 15
    invoke-static {v0, v1}, Ljava/lang/Math;->sqrt(D)D

    .line 16
    .line 17
    .line 18
    move-result-wide v0

    .line 19
    sput-wide v0, L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 20
    .line 21
    invoke-static {v0, v1}, Ljava/lang/Math;->sqrt(D)D

    .line 22
    .line 23
    .line 24
    move-result-wide v2

    .line 25
    sput-wide v2, L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:D

    .line 26
    .line 27
    const/4 v4, 0x1

    .line 28
    int-to-double v4, v4

    .line 29
    div-double v0, v4, v0

    .line 30
    .line 31
    sput-wide v0, L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:D

    .line 32
    .line 33
    div-double/2addr v4, v2

    .line 34
    sput-wide v4, L둥되뒐땧됐되될뎡뒛땨뎸딹딁땯뎽돝뒾땅도듟듼돶뒀따도딐뒹돛딃뒻뒬듸돝땫딜딃됨땤됐뎠둡들듼돨딄땅딸듼땀땦둑듐뎨땁됫땭둡둬뒐든땝땀땹둥땃듻땥딎땰땝딸듨돵땫듰뒨듔땸뎡딽돴듻돴둑땮땝듼든돸둥도땧땃돨땟뎻뒐딟듼둡딸딎땜된땯딹딜됩돝돛뒹딽땭된뎻들듨땳듟둔땜딎딝돼땰둬딀뎹돠된;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:D

    .line 35
    .line 36
    return-void
.end method
