.class public final L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;
.super Ljava/io/InputStream;
.source "SourceFile"


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/io/InputStream;

.field public final 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lkotlin/io/encoding/Base64;

.field public 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Z

.field public 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

.field public final 뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:[B

.field public final 뎡딞득땤뒀땝딹땮뒀딝땰듼뎽뒤뎽듸딃됴땰딌돼뒷딠듰뎰딀둬듔뒤둣땭땥딻둘뎨땯딽뒻딀뒋뎰땔득뒀둣땳땹뒼땄땠득딜돴땄뒬땟뒻돶땮뒉딌뒬뒙듼따딅듽뒤돸듌땨땯디뎽될딁돳둥돨딐둣둘돴뒨듽딹도땐땐뎡딽땟듸돝뎽따땯둣되땄뒉뒉딄듼딁도뎹돤뒼뒉땬땄딸뒵든뒉땨땃땄딨됩도딐득둑듔딽땵뒛돤:[B

.field public final 뎡땝뒻땥되딤돳뎽딀딅돼땫돛듼뎽뒝됩뒨땣땬뒤땦땜둠딞돰뒘뎸땰될땦듬땭땬두딄딹뎡돠뒝드된땵땱땡딹딸뒛듔뒹디둡딄돸딨돳뒾뒉뎬듸돼돰뒐듬돼둡됐돳둑뒉땟뒀됨뒾땀땥땥돼듬땃된딟딝돵땜딄뒼딞될땄딄딟따땀땄돝될돷딻든땝디땅딹듻돴딐돝둘땄듟도땠딸돤돠땸돳듌뒘뒨든딎딝뒷땧됨딹땣땋:[B

.field public 뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

.field public 뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I


# direct methods
.method public constructor <init>(Ljava/io/InputStream;Lkotlin/io/encoding/Base64;)V
    .locals 1

    .line 1
    const-string v0, "input"

    .line 2
    .line 3
    invoke-static {p1, v0}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    .line 4
    .line 5
    .line 6
    const-string v0, "base64"

    .line 7
    .line 8
    invoke-static {p2, v0}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    .line 9
    .line 10
    .line 11
    invoke-direct {p0}, Ljava/io/InputStream;-><init>()V

    .line 12
    .line 13
    .line 14
    iput-object p1, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/io/InputStream;

    .line 15
    .line 16
    iput-object p2, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lkotlin/io/encoding/Base64;

    .line 17
    .line 18
    const/4 p1, 0x1

    .line 19
    new-array p1, p1, [B

    .line 20
    .line 21
    iput-object p1, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:[B

    .line 22
    .line 23
    const/16 p1, 0x400

    .line 24
    .line 25
    new-array p2, p1, [B

    .line 26
    .line 27
    iput-object p2, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡딞득땤뒀땝딹땮뒀딝땰듼뎽뒤뎽듸딃됴땰딌돼뒷딠듰뎰딀둬듔뒤둣땭땥딻둘뎨땯딽뒻딀뒋뎰땔득뒀둣땳땹뒼땄땠득딜돴땄뒬땟뒻돶땮뒉딌뒬뒙듼따딅듽뒤돸듌땨땯디뎽될딁돳둥돨딐둣둘돴뒨듽딹도땐땐뎡딽땟듸돝뎽따땯둣되땄뒉뒉딄듼딁도뎹돤뒼뒉땬땄딸뒵든뒉땨땃땄딨됩도딐득둑듔딽땵뒛돤:[B

    .line 28
    .line 29
    new-array p1, p1, [B

    .line 30
    .line 31
    iput-object p1, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땝뒻땥되딤돳뎽딀딅돼땫돛듼뎽뒝됩뒨땣땬뒤땦땜둠딞돰뒘뎸땰될땦듬땭땬두딄딹뎡돠뒝드된땵땱땡딹딸뒛듔뒹디둡딄돸딨돳뒾뒉뎬듸돼돰뒐듬돼둡됐돳둑뒉땟뒀됨뒾땀땥땥돼듬땃된딟딝돵땜딄뒼딞될땄딄딟따땀땄돝될돷딻든땝디땅딹듻돴딐돝둘땄듟도땠딸돤돠땸돳듌뒘뒨든딎딝뒷땧됨딹땣땋:[B

    .line 32
    .line 33
    return-void
.end method


# virtual methods
.method public final close()V
    .locals 1

    .line 1
    iget-boolean v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Z

    .line 2
    .line 3
    if-nez v0, :cond_0

    .line 4
    .line 5
    const/4 v0, 0x1

    .line 6
    iput-boolean v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Z

    .line 7
    .line 8
    iget-object v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/io/InputStream;

    .line 9
    .line 10
    invoke-virtual {v0}, Ljava/io/InputStream;->close()V

    .line 11
    .line 12
    .line 13
    :cond_0
    return-void
.end method

.method public final read()I
    .locals 5

    .line 1
    iget v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    iget v1, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    const/4 v2, 0x0

    const/4 v3, 0x1

    if-ge v0, v1, :cond_1

    .line 2
    iget-object v4, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땝뒻땥되딤돳뎽딀딅돼땫돛듼뎽뒝됩뒨땣땬뒤땦땜둠딞돰뒘뎸땰될땦듬땭땬두딄딹뎡돠뒝드된땵땱땡딹딸뒛듔뒹디둡딄돸딨돳뒾뒉뎬듸돼돰뒐듬돼둡됐돳둑뒉땟뒀됨뒾땀땥땥돼듬땃된딟딝돵땜딄뒼딞될땄딄딟따땀땄돝될돷딻든땝디땅딹듻돴딐돝둘땄듟도땠딸돤돠땸돳듌뒘뒨든딎딝뒷땧됨딹땣땋:[B

    aget-byte v4, v4, v0

    and-int/lit16 v4, v4, 0xff

    add-int/2addr v0, v3

    .line 3
    iput v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    if-ne v0, v1, :cond_0

    .line 4
    iput v2, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    .line 5
    iput v2, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    :cond_0
    return v4

    .line 6
    :cond_1
    iget-object v0, p0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:[B

    invoke-virtual {p0, v0, v2, v3}, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->read([BII)I

    move-result v1

    const/4 v4, -0x1

    if-eq v1, v4, :cond_3

    if-ne v1, v3, :cond_2

    .line 7
    aget-byte v0, v0, v2

    and-int/lit16 v4, v0, 0xff

    goto :goto_0

    :cond_2
    new-instance v0, Ljava/lang/IllegalStateException;

    .line 8
    const-string v1, "Unreachable"

    invoke-direct {v0, v1}, Ljava/lang/IllegalStateException;-><init>(Ljava/lang/String;)V

    throw v0

    :cond_3
    :goto_0
    return v4
.end method

.method public final read([BII)I
    .locals 18

    move-object/from16 v0, p0

    move-object/from16 v1, p1

    move/from16 v2, p2

    move/from16 v3, p3

    const-string v4, "destination"

    invoke-static {v1, v4}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    if-ltz v2, :cond_14

    if-ltz v3, :cond_14

    add-int v4, v2, v3

    .line 9
    array-length v5, v1

    if-gt v4, v5, :cond_14

    .line 10
    iget-boolean v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Z

    if-nez v5, :cond_13

    .line 11
    iget-boolean v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    const/4 v6, -0x1

    if-eqz v5, :cond_0

    return v6

    :cond_0
    const/4 v5, 0x0

    if-nez v3, :cond_1

    return v5

    .line 12
    :cond_1
    iget v7, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    iget v8, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    sub-int v9, v7, v8

    .line 13
    iget-object v10, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땝뒻땥되딤돳뎽딀딅돼땫돛듼뎽뒝됩뒨땣땬뒤땦땜둠딞돰뒘뎸땰될땦듬땭땬두딄딹뎡돠뒝드된땵땱땡딹딸뒛듔뒹디둡딄돸딨돳뒾뒉뎬듸돼돰뒐듬돼둡됐돳둑뒉땟뒀됨뒾땀땥땥돼듬땃된딟딝돵땜딄뒼딞될땄딄딟따땀땄돝될돷딻든땝디땅딹듻돴딐돝둘땄듟도땠딸돤돠땸돳듌뒘뒨든딎딝뒷땧됨딹땣땋:[B

    if-lt v9, v3, :cond_3

    add-int v4, v8, v3

    .line 14
    invoke-static {v10, v1, v2, v8, v4}, Lkotlin/collections/ArraysKt___ArraysJvmKt;->copyInto([B[BIII)[B

    .line 15
    iget v1, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    add-int/2addr v1, v3

    iput v1, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    .line 16
    iget v2, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    if-ne v1, v2, :cond_2

    .line 17
    iput v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    .line 18
    iput v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    :cond_2
    return v3

    :cond_3
    sub-int/2addr v7, v8

    sub-int/2addr v3, v7

    const/4 v7, 0x2

    add-int/2addr v3, v7

    .line 19
    div-int/lit8 v3, v3, 0x3

    mul-int/lit8 v3, v3, 0x4

    move v8, v2

    .line 20
    :goto_0
    iget-boolean v9, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    if-nez v9, :cond_11

    if-lez v3, :cond_11

    .line 21
    iget-object v9, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡딞득땤뒀땝딹땮뒀딝땰듼뎽뒤뎽듸딃됴땰딌돼뒷딠듰뎰딀둬듔뒤둣땭땥딻둘뎨땯딽뒻딀뒋뎰땔득뒀둣땳땹뒼땄땠득딜돴땄뒬땟뒻돶땮뒉딌뒬뒙듼따딅듽뒤돸듌땨땯디뎽될딁돳둥돨딐둣둘돴뒨듽딹도땐땐뎡딽땟듸돝뎽따땯둣되땄뒉뒉딄듼딁도뎹돤뒼뒉땬땄딸뒵든뒉땨땃땄딨됩도딐득둑듔딽땵뒛돤:[B

    array-length v11, v9

    invoke-static {v11, v3}, Ljava/lang/Math;->min(II)I

    move-result v11

    const/4 v15, 0x0

    .line 22
    :goto_1
    iget-boolean v12, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    if-nez v12, :cond_c

    if-ge v15, v11, :cond_c

    .line 23
    iget-object v12, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lkotlin/io/encoding/Base64;

    invoke-virtual {v12}, Lkotlin/io/encoding/Base64;->isMimeScheme$kotlin_stdlib()Z

    move-result v13

    iget-object v14, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/io/InputStream;

    if-nez v13, :cond_4

    .line 24
    invoke-virtual {v14}, Ljava/io/InputStream;->read()I

    move-result v13

    goto :goto_2

    .line 25
    :cond_4
    invoke-virtual {v14}, Ljava/io/InputStream;->read()I

    move-result v13

    if-eq v13, v6, :cond_5

    .line 26
    invoke-static {v13}, Lkotlin/io/encoding/Base64Kt;->isInMimeAlphabet(I)Z

    move-result v16

    if-eqz v16, :cond_4

    :cond_5
    :goto_2
    if-eq v13, v6, :cond_b

    const/16 v5, 0x3d

    if-eq v13, v5, :cond_6

    int-to-byte v5, v13

    .line 27
    aput-byte v5, v9, v15

    add-int/lit8 v15, v15, 0x1

    :goto_3
    const/4 v5, 0x0

    goto :goto_1

    .line 28
    :cond_6
    aput-byte v5, v9, v15

    and-int/lit8 v5, v15, 0x3

    if-ne v5, v7, :cond_a

    .line 29
    invoke-virtual {v12}, Lkotlin/io/encoding/Base64;->isMimeScheme$kotlin_stdlib()Z

    move-result v5

    if-nez v5, :cond_7

    .line 30
    invoke-virtual {v14}, Ljava/io/InputStream;->read()I

    move-result v5

    goto :goto_4

    .line 31
    :cond_7
    invoke-virtual {v14}, Ljava/io/InputStream;->read()I

    move-result v5

    if-eq v5, v6, :cond_8

    .line 32
    invoke-static {v5}, Lkotlin/io/encoding/Base64Kt;->isInMimeAlphabet(I)Z

    move-result v12

    if-eqz v12, :cond_7

    :cond_8
    :goto_4
    if-ltz v5, :cond_9

    add-int/lit8 v12, v15, 0x1

    int-to-byte v5, v5

    .line 33
    aput-byte v5, v9, v12

    :cond_9
    add-int/lit8 v15, v15, 0x2

    :goto_5
    const/4 v5, 0x1

    goto :goto_6

    :cond_a
    add-int/lit8 v15, v15, 0x1

    goto :goto_5

    .line 34
    :goto_6
    iput-boolean v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    goto :goto_3

    :cond_b
    const/4 v5, 0x1

    .line 35
    iput-boolean v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    goto :goto_3

    :cond_c
    if-nez v12, :cond_e

    if-ne v15, v11, :cond_d

    goto :goto_7

    .line 36
    :cond_d
    new-instance v1, Ljava/lang/IllegalStateException;

    const-string v2, "Check failed."

    invoke-direct {v1, v2}, Ljava/lang/IllegalStateException;-><init>(Ljava/lang/String;)V

    throw v1

    :cond_e
    :goto_7
    sub-int/2addr v3, v15

    .line 37
    iget v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    iget-object v14, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땝뒻땥되딤돳뎽딀딅돼땫돛듼뎽뒝됩뒨땣땬뒤땦땜둠딞돰뒘뎸땰될땦듬땭땬두딄딹뎡돠뒝드된땵땱땡딹딸뒛듔뒹디둡딄돸딨돳뒾뒉뎬듸돼돰뒐듬돼둡됐돳둑뒉땟뒀됨뒾땀땥땥돼듬땃된딟딝돵땜딄뒼딞될땄딄딟따땀땄돝될돷딻든땝디땅딹듻돴딐돝둘땄듟도땠딸돤돠땸돳듌뒘뒨든딎딝뒷땧됨딹땣땋:[B

    const/16 v16, 0x0

    iget-object v12, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lkotlin/io/encoding/Base64;

    iget-object v13, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡딞득땤뒀땝딹땮뒀딝땰듼뎽뒤뎽듸딃됴땰딌돼뒷딠듰뎰딀둬듔뒤둣땭땥딻둘뎨땯딽뒻딀뒋뎰땔득뒀둣땳땹뒼땄땠득딜돴땄뒬땟뒻돶땮뒉딌뒬뒙듼따딅듽뒤돸듌땨땯디뎽될딁돳둥돨딐둣둘돴뒨듽딹도땐땐뎡딽땟듸돝뎽따땯둣되땄뒉뒉딄듼딁도뎹돤뒼뒉땬땄딸뒵든뒉땨땃땄딨됩도딐득둑듔딽땵뒛돤:[B

    move v11, v15

    move v15, v5

    move/from16 v17, v11

    invoke-virtual/range {v12 .. v17}, Lkotlin/io/encoding/Base64;->decodeIntoByteArray([B[BIII)I

    move-result v11

    add-int/2addr v5, v11

    iput v5, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    .line 38
    iget v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    sub-int/2addr v5, v11

    sub-int v11, v4, v8

    .line 39
    invoke-static {v5, v11}, Ljava/lang/Math;->min(II)I

    move-result v5

    .line 40
    iget v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    add-int v12, v11, v5

    .line 41
    invoke-static {v10, v1, v8, v11, v12}, Lkotlin/collections/ArraysKt___ArraysJvmKt;->copyInto([B[BIII)[B

    .line 42
    iget v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    add-int/2addr v11, v5

    iput v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    .line 43
    iget v12, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    if-ne v11, v12, :cond_f

    const/4 v11, 0x0

    .line 44
    iput v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    .line 45
    iput v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    goto :goto_8

    :cond_f
    const/4 v11, 0x0

    .line 46
    :goto_8
    array-length v12, v10

    iget v13, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    sub-int/2addr v12, v13

    .line 47
    array-length v9, v9

    div-int/lit8 v9, v9, 0x4

    mul-int/lit8 v9, v9, 0x3

    if-le v9, v12, :cond_10

    .line 48
    iget v9, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    invoke-static {v10, v10, v11, v9, v13}, Lkotlin/collections/ArraysKt___ArraysJvmKt;->copyInto([B[BIII)[B

    .line 49
    iget v9, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    iget v12, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    sub-int/2addr v9, v12

    iput v9, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎨돶땰딎땵딃됨드땭두뒹듟땭땧될땤돝땡땟땡득땫땟듌둑듔뒐둔뒨딽땪돵둥뒬돝뒼뒹땻딹둡듔든땐땰땜땠돳땔될땪두땃딄되돸든돵뎬둘땨딀둡땲뎽땬듬딝딃땜뒼됨땤딝돴듽돰듻땲됫듸든둬듰듰듸뒈땳땠뎰딽둬딽뒼딎땃돸돳딠뒷뒛땯듬뎬땅땀되될딅땩땵됨땐땧뎰뎨땥됩뒋됐딟따됐땮뎡돛듰딸뎬뒙돷:I

    .line 50
    iput v11, v0, L뒀땟뒻땨땩딅됨땡딎땄땲딹뎰디땤돷뎠돼뒋땀든딽둔뎸딄딄돝뒉뒛딠땧뎠딞딁땣됩뒬딨딁뒬뒐뒝듰듽뒋땬듨뒤됩뒻돴뎸땁땡둔땬딄땨둑뒵땲뒝땬따돼뒀됩딤뒾딅딄도땦둥땻딀딄됐둘땋듻돛뒐딄땻땃딽땭딝될돷땳뒼뒻딞딄딌뎸됴둔딅딽듻딄딄뒾둔뎡둣땤뎨둬두땱딽둡뎸딸됫땁둠두뒛땵돸돛딁됨땱뒵;->뎡땣땮땻둔땀딨뎸됴뎨땮듽뒼따땠듬돰듟뒉돤뒹딄딟땠돶딜딤듔드돵땃뎹듽딅둔땹듔딽듟뒛듌뎰돛든돼뎨딝돝되딠듟된돶뒋뎸뒉둔되뎬됨뒾될땩딐땀됐듼돛뒛땹딜딄뎨딹듰딜뎨듻땍딠뎸딤뒨땝듰따듐딄딤땯땮딹됨땨땧뒹땧됩땻땬듟뒹뒷돼될땐뎸도돰딨돵듟득뎽뒨듸뒘따뒛뒝뒙땐뎬돵뎰디딜땝됨두:I

    :cond_10
    add-int/2addr v8, v5

    const/4 v5, 0x0

    goto/16 :goto_0

    :cond_11
    if-ne v8, v2, :cond_12

    if-eqz v9, :cond_12

    goto :goto_9

    :cond_12
    sub-int v6, v8, v2

    :goto_9
    return v6

    .line 51
    :cond_13
    new-instance v1, Ljava/io/IOException;

    const-string v2, "The input stream is closed."

    invoke-direct {v1, v2}, Ljava/io/IOException;-><init>(Ljava/lang/String;)V

    throw v1

    .line 52
    :cond_14
    new-instance v4, Ljava/lang/IndexOutOfBoundsException;

    const-string v5, "offset: "

    const-string v6, ", length: "

    const-string v7, ", buffer size: "

    .line 53
    invoke-static {v2, v3, v5, v6, v7}, L뎬둘듸돸뒹듽뎽됨뎨땄뎽듼돤땠땩땐뎡땍됩땔딝뎹듼됴딄듔딟뒤땪뎡듸돴뎰뎽땳됩돰땠돠땵땬땸딀됐땦뒵뒝됫딟땔땻뒵딸둑땯땪땧돛뎸땋땝뎨딀땔도딃땋든뒘뒙도돸딅땵됩됴땐돰둑뒾땸돷땵뒉땨땸땁둠뒷듰돵땐땝뒹둬땜듟땄됨드돴둥듐둡뒻뎻뎹둬땪딟땩둣땰땵땡땻딹땸땳딄딽뒈땪딹뒘뎡땥뒾땭뎡;->뎨뒋딝뒘땻땭땳뒨돵뒋땡돛딟따뒷땮돴딤딃들땡돸땀뒘돳뎹됩둑딠뒬딤뎸땁뒙뒾딽딄뒷뒘땯도두뎠돸돤뒝돼뒵땳땰딅든뒻뒘땰땯땅뒼돤딃두딁땔듌뒵뎸돷뒘됴딻듔땬돵돼둔땸돨땧돝땲땧땥돛뒼뒋땨돶땮도땁돳듔돳뒈돨딟땨뎹딽둡뒤땐뒘뎡땃땯딐딄뒐땧뒤딹뒬딃땋뎽땮딅뎽뎻딞땡땮뎽뒙듟뎡뎹뒐딁(IILjava/lang/String;Ljava/lang/String;Ljava/lang/String;)Ljava/lang/StringBuilder;

    move-result-object v2

    .line 54
    array-length v1, v1

    invoke-virtual {v2, v1}, Ljava/lang/StringBuilder;->append(I)Ljava/lang/StringBuilder;

    invoke-virtual {v2}, Ljava/lang/StringBuilder;->toString()Ljava/lang/String;

    move-result-object v1

    invoke-direct {v4, v1}, Ljava/lang/IndexOutOfBoundsException;-><init>(Ljava/lang/String;)V

    throw v4
.end method
