.class public final L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Lkotlin/sequences/Sequence;
.implements Lkotlin/sequences/DropTakeSequence;


# static fields
.field public static final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;


# direct methods
.method static constructor <clinit>()V
    .locals 1

    .line 1
    new-instance v0, L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;

    .line 2
    .line 3
    invoke-direct {v0}, Ljava/lang/Object;-><init>()V

    .line 4
    .line 5
    .line 6
    sput-object v0, L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;

    .line 7
    .line 8
    return-void
.end method


# virtual methods
.method public final bridge synthetic drop(I)Lkotlin/sequences/Sequence;
    .locals 0

    .line 1
    sget-object p1, L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;

    .line 2
    .line 3
    return-object p1
.end method

.method public final iterator()Ljava/util/Iterator;
    .locals 1

    .line 1
    sget-object v0, Lkotlin/collections/EmptyIterator;->INSTANCE:Lkotlin/collections/EmptyIterator;

    .line 2
    .line 3
    return-object v0
.end method

.method public final bridge synthetic take(I)Lkotlin/sequences/Sequence;
    .locals 0

    .line 1
    sget-object p1, L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:L뒙땰땤땀딝딁땁둑뒈땬땱딹땜돳드됩딞뒵딨둡땨딝둬뒾뒉딝땸땐뎰땅둡됫땸땩뎬돰뒹땣땵뎠땸뒤듻딁뒀땋딐땣돠둑땦땯땳도땧듸땵뎠둔뒀뒈디디뒐뎡땦땡땄뒘뒋듨땰디듰됐둬돤뎰돳뒀뒷땭디딌뎰뒈듼땥두됨땥딃땟디땲뒤돵둣될듟듌되딄둥돴땣돵뒨뎹뎬돼뒉딸땭땅된땐뒤돸득듐됩돵딠땸딞땭듰뒝뒼;

    .line 2
    .line 3
    return-object p1
.end method
