.class public final synthetic L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Lkotlin/jvm/functions/Function0;


# instance fields
.field public final synthetic 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

.field public final synthetic 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/v2ray/ang/plugin/ResolvedPlugin;


# direct methods
.method public synthetic constructor <init>(Lcom/v2ray/ang/plugin/ResolvedPlugin;I)V
    .locals 0

    .line 1
    iput p2, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    iput-object p1, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/v2ray/ang/plugin/ResolvedPlugin;

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    return-void
.end method


# virtual methods
.method public final invoke()Ljava/lang/Object;
    .locals 1

    .line 1
    iget v0, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    packed-switch v0, :pswitch_data_0

    iget-object v0, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/v2ray/ang/plugin/ResolvedPlugin;

    invoke-static {v0}, Lcom/v2ray/ang/plugin/ResolvedPlugin;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉(Lcom/v2ray/ang/plugin/ResolvedPlugin;)Ljava/lang/String;

    move-result-object v0

    return-object v0

    :pswitch_0
    iget-object v0, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/v2ray/ang/plugin/ResolvedPlugin;

    invoke-static {v0}, Lcom/v2ray/ang/plugin/ResolvedPlugin;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸(Lcom/v2ray/ang/plugin/ResolvedPlugin;)I

    move-result v0

    invoke-static {v0}, Ljava/lang/Integer;->valueOf(I)Ljava/lang/Integer;

    move-result-object v0

    return-object v0

    :pswitch_1
    iget-object v0, p0, L땅땪뒹뒨땜뎻돨돴땧딁되듌돷들듌땧딻둡땤돤땐뎹땝뒛둑뒈뒈돳돶땯돠딻된뒾뎠듻땝뎸돤땝따듌땹뒛뒾디땲땻땸딝뒉땸뒨드딻뒝돳딻뎨딻드땁돛듬딃딤땄됨땀땤땡둬뎡따뒝딽땁땍땜돳돰돠딜땃딤된됩듟뎻땍딹딐땁땮땅땫딠둘땤뎨됫둥듔땝땰돤뒹뎠뎠둥되돸딹딹뎨뒛뎬돰듻땲돼두딟뒻뎻딞듬뒼땻듻;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/v2ray/ang/plugin/ResolvedPlugin;

    invoke-static {v0}, Lcom/v2ray/ang/plugin/ResolvedPlugin;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫(Lcom/v2ray/ang/plugin/ResolvedPlugin;)Ljava/lang/String;

    move-result-object v0

    return-object v0

    :pswitch_data_0
    .packed-switch 0x0
        :pswitch_1
        :pswitch_0
    .end packed-switch
.end method
