.class public final synthetic L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Ljava/lang/Runnable;


# instance fields
.field public final synthetic 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

.field public final synthetic 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/service/c_06;


# direct methods
.method public synthetic constructor <init>(Lcom/tknetwork/tunnel/service/c_06;I)V
    .locals 0

    .line 1
    iput p2, p0, L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    iput-object p1, p0, L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/service/c_06;

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    return-void
.end method


# virtual methods
.method public final run()V
    .locals 1

    .line 1
    iget v0, p0, L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    packed-switch v0, :pswitch_data_0

    iget-object v0, p0, L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/service/c_06;

    invoke-virtual {v0}, Lcom/tknetwork/tunnel/service/c_06;->startTunnel()V

    return-void

    :pswitch_0
    iget-object v0, p0, L땸뒋되돸땭딞딎돼딠뒼듽딤땱뒐땃땤듬됨땰뎨뎡딐돛되돛돤됩땡땸돼돷둔뒼됫땡돵땃돰땟땣둑딁둠땪됴땡땭돴땫둡뒝됴둘두뎸땋둥딜뒾돝땅뒘딐든땦땃딐돶땩뎠딄뒀땱듨딹뒻딽딞딝됩땳딞땋땫두땫둥뒨뎽땋될듐뒘땱땭땱뒹땬땳될됴따땍둑딀돝됫뒤둠땔돤땰듽된땁땦듻딝땱땮딀뒐드뒙땔된됫땣뎹뎨;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/service/c_06;

    invoke-static {v0}, Lcom/tknetwork/tunnel/service/c_06;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸(Lcom/tknetwork/tunnel/service/c_06;)V

    return-void

    nop

    :pswitch_data_0
    .packed-switch 0x0
        :pswitch_0
    .end packed-switch
.end method
