.class public final L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;
.super Lkotlin/collections/DoubleIterator;
.source "SourceFile"


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:[D

.field public 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I


# direct methods
.method public constructor <init>([D)V
    .locals 1

    .line 1
    const-string v0, "array"

    .line 2
    .line 3
    invoke-static {p1, v0}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    .line 4
    .line 5
    .line 6
    invoke-direct {p0}, Lkotlin/collections/DoubleIterator;-><init>()V

    .line 7
    .line 8
    .line 9
    iput-object p1, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:[D

    .line 10
    .line 11
    return-void
.end method


# virtual methods
.method public final hasNext()Z
    .locals 2

    .line 1
    iget v0, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 2
    .line 3
    iget-object v1, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:[D

    .line 4
    .line 5
    array-length v1, v1

    .line 6
    if-ge v0, v1, :cond_0

    .line 7
    .line 8
    const/4 v0, 0x1

    .line 9
    goto :goto_0

    .line 10
    :cond_0
    const/4 v0, 0x0

    .line 11
    :goto_0
    return v0
.end method

.method public final nextDouble()D
    .locals 3

    .line 1
    :try_start_0
    iget-object v0, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:[D

    .line 2
    .line 3
    iget v1, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 4
    .line 5
    add-int/lit8 v2, v1, 0x1

    .line 6
    .line 7
    iput v2, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 8
    .line 9
    aget-wide v1, v0, v1
    :try_end_0
    .catch Ljava/lang/ArrayIndexOutOfBoundsException; {:try_start_0 .. :try_end_0} :catch_0

    .line 10
    .line 11
    return-wide v1

    .line 12
    :catch_0
    move-exception v0

    .line 13
    iget v1, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 14
    .line 15
    add-int/lit8 v1, v1, -0x1

    .line 16
    .line 17
    iput v1, p0, L뎽땰돰둬돤돼듌둡돴돠딟땭뒨돵둘땨뒛땪땪딸돶뎽딄드땸뒾딸뒝됴땯땹땭듨둡둠땵뒵듼되듔딨뒐뒾돝둑듬뎬딟듨땸땀딻두땐땵뎸뎸뒐뒵둘돸뒉될딞됐딄뒤됐땭돵딤딝듸돳땀둥땵듽도뒷딸뒷될듟됩땧됨둔둣든땱땣따들됫뒨땜듌땤뎨뎹돠뎡딁듰딞땫뒐딅땠둥딄땐디뒙뒷뒾딹두땟뒤딝되돼땄땦땡땻듻듰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 18
    .line 19
    new-instance v1, Ljava/util/NoSuchElementException;

    .line 20
    .line 21
    invoke-virtual {v0}, Ljava/lang/Throwable;->getMessage()Ljava/lang/String;

    .line 22
    .line 23
    .line 24
    move-result-object v0

    .line 25
    invoke-direct {v1, v0}, Ljava/util/NoSuchElementException;-><init>(Ljava/lang/String;)V

    .line 26
    .line 27
    .line 28
    throw v1
.end method
