.class public final L듸뒋땲듼될딀딻듨됴딄땧듽딠둬됴땯돶땣둡땫뎽뒨됩둥될땰뒉뒻듨둬땋뎽된돷듰땃듼뎻뎨땃됴땍뒾듬듔딄돠도디됐뒋딎땐뎡땸돳딜땣뒬돠됩둣둬듨돤딝둘돰땹두땁듸뒻될둬딞됐뎻뒋땦딃듔땧뒛뒀둔딽돰득돷둣땵땄뎨뒛뎸뎽땠듟땫땁땬땡딃뎡땝듼딠듰땜딐땮두뒉된딽딁뒨돳돝땠됴돝딀땧땣뒼들땦뒉;
.super L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;
.source "SourceFile"


# instance fields
.field public 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z


# virtual methods
.method public final close()V
    .locals 1

    .line 1
    iget-boolean v0, p0, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 2
    .line 3
    if-eqz v0, :cond_0

    .line 4
    .line 5
    return-void

    .line 6
    :cond_0
    iget-boolean v0, p0, L듸뒋땲듼될딀딻듨됴딄땧듽딠둬됴땯돶땣둡땫뎽뒨됩둥될땰뒉뒻듨둬땋뎽된돷듰땃듼뎻뎨땃됴땍뒾듬듔딄돠도디됐뒋딎땐뎡땸돳딜땣뒬돠됩둣둬듨돤딝둘돰땹두땁듸뒻될둬딞됐뎻뒋땦딃듔땧뒛뒀둔딽돰득돷둣땵땄뎨뒛뎸뎽땠듟땫땁땬땡딃뎡땝듼딠듰땜딐땮두뒉된딽딁뒨돳돝땠됴돝딀땧땣뒼들땦뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    .line 7
    .line 8
    if-nez v0, :cond_1

    .line 9
    .line 10
    invoke-virtual {p0}, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸()V

    .line 11
    .line 12
    .line 13
    :cond_1
    const/4 v0, 0x1

    .line 14
    iput-boolean v0, p0, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 15
    .line 16
    return-void
.end method

.method public final read(Lokio/Buffer;J)J
    .locals 3

    .line 1
    const-string v0, "sink"

    .line 2
    .line 3
    invoke-static {p1, v0}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    .line 4
    .line 5
    .line 6
    const-wide/16 v0, 0x0

    .line 7
    .line 8
    cmp-long v2, p2, v0

    .line 9
    .line 10
    if-ltz v2, :cond_3

    .line 11
    .line 12
    iget-boolean v0, p0, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 13
    .line 14
    if-nez v0, :cond_2

    .line 15
    .line 16
    iget-boolean v0, p0, L듸뒋땲듼될딀딻듨됴딄땧듽딠둬됴땯돶땣둡땫뎽뒨됩둥될땰뒉뒻듨둬땋뎽된돷듰땃듼뎻뎨땃됴땍뒾듬듔딄돠도디됐뒋딎땐뎡땸돳딜땣뒬돠됩둣둬듨돤딝둘돰땹두땁듸뒻될둬딞됐뎻뒋땦딃듔땧뒛뒀둔딽돰득돷둣땵땄뎨뒛뎸뎽땠듟땫땁땬땡딃뎡땝듼딠듰땜딐땮두뒉된딽딁뒨돳돝땠됴돝딀땧땣뒼들땦뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    .line 17
    .line 18
    const-wide/16 v1, -0x1

    .line 19
    .line 20
    if-eqz v0, :cond_0

    .line 21
    .line 22
    return-wide v1

    .line 23
    :cond_0
    invoke-super {p0, p1, p2, p3}, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->read(Lokio/Buffer;J)J

    .line 24
    .line 25
    .line 26
    move-result-wide p1

    .line 27
    cmp-long p3, p1, v1

    .line 28
    .line 29
    if-nez p3, :cond_1

    .line 30
    .line 31
    const/4 p1, 0x1

    .line 32
    iput-boolean p1, p0, L듸뒋땲듼될딀딻듨됴딄땧듽딠둬됴땯돶땣둡땫뎽뒨됩둥될땰뒉뒻듨둬땋뎽된돷듰땃듼뎻뎨땃됴땍뒾듬듔딄돠도디됐뒋딎땐뎡땸돳딜땣뒬돠됩둣둬듨돤딝둘돰땹두땁듸뒻될둬딞됐뎻뒋땦딃듔땧뒛뒀둔딽돰득돷둣땵땄뎨뒛뎸뎽땠듟땫땁땬땡딃뎡땝듼딠듰땜딐땮두뒉된딽딁뒨돳돝땠됴돝딀땧땣뒼들땦뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:Z

    .line 33
    .line 34
    invoke-virtual {p0}, L듰듰뒼딸땄땪땯돸땤땟땥돰땯땯됫땦득둣뒈뒐땱뒋땁딌땟딅돴듼듽듸땐땮땄듰뒤둠듔땯돛딞뒼땵뒤땪될땟돸땭돵돶뒀돸딁뎽뒀땍돶딹돴돰따딟딃뒼딹돨돤돷돸딠둬뒤뒝딹뒉돨뎬듻뎨듐뎸돼돸땩듔됴디딟도땋두딠땱딜딹땁뒹딝드돛땪됨드돰땤둔도땋돨딽딨될땮둘듌땱땃딄땋땧뒬두돨땐딎듨돷따뒨뒹;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸()V

    .line 35
    .line 36
    .line 37
    return-wide v1

    .line 38
    :cond_1
    return-wide p1

    .line 39
    :cond_2
    new-instance p1, Ljava/lang/IllegalStateException;

    .line 40
    .line 41
    const-string p2, "closed"

    .line 42
    .line 43
    invoke-direct {p1, p2}, Ljava/lang/IllegalStateException;-><init>(Ljava/lang/String;)V

    .line 44
    .line 45
    .line 46
    throw p1

    .line 47
    :cond_3
    const-string p1, "byteCount < 0: "

    .line 48
    .line 49
    invoke-static {p1, p2, p3}, L뒵듽드둔뎬듨땻뒤땍뒉득땦돨땡됐땠돸땁듌됴뒈뒀뎹듬땐둣듻둑뒘딜됴돰땣듼뒝땁땩땱딌듼된땀두땥돸딅듼땸뎠듰땬돷땩디딄듻듐땵됐땃뒾딸땔뎡딄듟땟땅됨땅돳딝뒐딁땍됫돸땟딠둣딝돠딎된둡땯되땠듟돷든듬뒹돰딎딠됨됫땜딠땄될땰땱돰땝딝돵딀돶땋뒨돴딐돨땩둣딸될둥돠딽돛디땳딄딄뒀듼돴;->뎨딐딁들땠듟땣땝딄둬돨땁땸뒷돵뒝듨뒬딀듨듔딁뒐땯되들돶듰땋듽듸땡둥딹됨돨듼땀땝딀땳땍됨땱뒀땵될됫땪뒼돨땲뎹딨딅딄땜딜땨듌땫둑딜땠뒨땮땸뎡둔됫듐뒾따됐돶둡땦땲땵뒤땄든땃든뒵둑따돶듻드뒋뎸뎸돨뒘듽땧딻땋딸땯뒹딤땤디뒀둡되땯뒾뎹뒷됴뒨딁땰들됨된딜둬땣땀땔딸됩땩돴땡뎨(Ljava/lang/String;J)Ljava/lang/String;

    .line 50
    .line 51
    .line 52
    move-result-object p1

    .line 53
    new-instance p2, Ljava/lang/IllegalArgumentException;

    .line 54
    .line 55
    invoke-virtual {p1}, Ljava/lang/Object;->toString()Ljava/lang/String;

    .line 56
    .line 57
    .line 58
    move-result-object p1

    .line 59
    invoke-direct {p2, p1}, Ljava/lang/IllegalArgumentException;-><init>(Ljava/lang/String;)V

    .line 60
    .line 61
    .line 62
    throw p2
.end method
