.class public final L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Ljava/util/Iterator;
.implements Lkotlin/jvm/internal/markers/KMappedMarker;


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/lang/CharSequence;

.field public 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

.field public 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

.field public 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

.field public 뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:I


# direct methods
.method public constructor <init>(Ljava/lang/CharSequence;)V
    .locals 1

    .line 1
    const-string v0, "string"

    .line 2
    .line 3
    invoke-static {p1, v0}, Lkotlin/jvm/internal/Intrinsics;->checkNotNullParameter(Ljava/lang/Object;Ljava/lang/String;)V

    .line 4
    .line 5
    .line 6
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 7
    .line 8
    .line 9
    iput-object p1, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/lang/CharSequence;

    .line 10
    .line 11
    return-void
.end method


# virtual methods
.method public final hasNext()Z
    .locals 9

    .line 1
    iget v0, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 2
    .line 3
    const/4 v1, 0x0

    .line 4
    const/4 v2, 0x1

    .line 5
    if-eqz v0, :cond_1

    .line 6
    .line 7
    if-ne v0, v2, :cond_0

    .line 8
    .line 9
    const/4 v1, 0x1

    .line 10
    :cond_0
    return v1

    .line 11
    :cond_1
    iget v0, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:I

    .line 12
    .line 13
    const/4 v3, 0x2

    .line 14
    if-gez v0, :cond_2

    .line 15
    .line 16
    iput v3, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 17
    .line 18
    return v1

    .line 19
    :cond_2
    iget-object v0, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/lang/CharSequence;

    .line 20
    .line 21
    invoke-interface {v0}, Ljava/lang/CharSequence;->length()I

    .line 22
    .line 23
    .line 24
    move-result v1

    .line 25
    iget v4, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

    .line 26
    .line 27
    invoke-interface {v0}, Ljava/lang/CharSequence;->length()I

    .line 28
    .line 29
    .line 30
    move-result v5

    .line 31
    :goto_0
    if-ge v4, v5, :cond_5

    .line 32
    .line 33
    invoke-interface {v0, v4}, Ljava/lang/CharSequence;->charAt(I)C

    .line 34
    .line 35
    .line 36
    move-result v6

    .line 37
    const/16 v7, 0xd

    .line 38
    .line 39
    const/16 v8, 0xa

    .line 40
    .line 41
    if-eq v6, v8, :cond_3

    .line 42
    .line 43
    if-eq v6, v7, :cond_3

    .line 44
    .line 45
    add-int/lit8 v4, v4, 0x1

    .line 46
    .line 47
    goto :goto_0

    .line 48
    :cond_3
    if-ne v6, v7, :cond_4

    .line 49
    .line 50
    add-int/lit8 v1, v4, 0x1

    .line 51
    .line 52
    invoke-interface {v0}, Ljava/lang/CharSequence;->length()I

    .line 53
    .line 54
    .line 55
    move-result v5

    .line 56
    if-ge v1, v5, :cond_4

    .line 57
    .line 58
    invoke-interface {v0, v1}, Ljava/lang/CharSequence;->charAt(I)C

    .line 59
    .line 60
    .line 61
    move-result v0

    .line 62
    if-ne v0, v8, :cond_4

    .line 63
    .line 64
    goto :goto_1

    .line 65
    :cond_4
    const/4 v3, 0x1

    .line 66
    :goto_1
    move v1, v4

    .line 67
    goto :goto_2

    .line 68
    :cond_5
    const/4 v3, -0x1

    .line 69
    :goto_2
    iput v2, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 70
    .line 71
    iput v3, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:I

    .line 72
    .line 73
    iput v1, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

    .line 74
    .line 75
    return v2
.end method

.method public final next()Ljava/lang/Object;
    .locals 3

    .line 1
    invoke-virtual {p0}, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->hasNext()Z

    .line 2
    .line 3
    .line 4
    move-result v0

    .line 5
    if-eqz v0, :cond_0

    .line 6
    .line 7
    const/4 v0, 0x0

    .line 8
    iput v0, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:I

    .line 9
    .line 10
    iget v0, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

    .line 11
    .line 12
    iget v1, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

    .line 13
    .line 14
    iget v2, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨:I

    .line 15
    .line 16
    add-int/2addr v2, v0

    .line 17
    iput v2, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

    .line 18
    .line 19
    iget-object v2, p0, L딄땪땪됨듨딐둡듰땵듌둥뎽듐땣돛땣돰돝뒉두뒀땍뒋땱됨땔두땳땻돰땀땹딻들땔돝뎰땵딌뒾뎸뒹땍땳땜됐땬뒬될될돝뒙뒐땐땩땀둑딤듔들땭뒬땜둔돝뎹뎽딅득듔뒾땭땔딤뒵땨딤듰되뒈뎨듐듐뒉뒝뒬딌듼딁뒉뒹두됫뒾될둠듬딀뒼딝땟둑땥딄둥땠들돨딀둔듨딃딁땹딅딸딞땋땮땪따딠딟둔땫듬땳됐땨뎸;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Ljava/lang/CharSequence;

    .line 20
    .line 21
    invoke-interface {v2, v1, v0}, Ljava/lang/CharSequence;->subSequence(II)Ljava/lang/CharSequence;

    .line 22
    .line 23
    .line 24
    move-result-object v0

    .line 25
    invoke-virtual {v0}, Ljava/lang/Object;->toString()Ljava/lang/String;

    .line 26
    .line 27
    .line 28
    move-result-object v0

    .line 29
    return-object v0

    .line 30
    :cond_0
    new-instance v0, Ljava/util/NoSuchElementException;

    .line 31
    .line 32
    invoke-direct {v0}, Ljava/util/NoSuchElementException;-><init>()V

    .line 33
    .line 34
    .line 35
    throw v0
.end method

.method public final remove()V
    .locals 2

    .line 1
    new-instance v0, Ljava/lang/UnsupportedOperationException;

    .line 2
    .line 3
    const-string v1, "Operation is not supported for read-only collection"

    .line 4
    .line 5
    invoke-direct {v0, v1}, Ljava/lang/UnsupportedOperationException;-><init>(Ljava/lang/String;)V

    .line 6
    .line 7
    .line 8
    throw v0
.end method
