.class public final L딤땀돶땤뎽땸땤뒨됨땻딀뒙뒨딃땍딸뒀땡됴뒈둬딄돤딜뒬땲땡딄딁땐땵땯될뒈땫됫딁뒼돳땥뎠뒻뒋땭돝돳땀뒻뒀땲딟뎨드뎬돠뒻땰땭땲땜땪땔뒋뒤든땪땣땟됴땋뒨됩돝땮땬든돳딤땄뒛둔딌딠됨딅땃듟둑둡될땮돛된뒾땪드돠뒵둔땪둠둣딁땥땟둔땥딄땳돸듟딟뒈땍둑둑뎨땭땡된딞듽뒈됫땲뒬땤뒘득둔;
.super Ljava/lang/Object;
.source "SourceFile"


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:J


# direct methods
.method public constructor <init>(J)V
    .locals 0

    .line 1
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 2
    .line 3
    .line 4
    iput-wide p1, p0, L딤땀돶땤뎽땸땤뒨됨땻딀뒙뒨딃땍딸뒀땡됴뒈둬딄돤딜뒬땲땡딄딁땐땵땯될뒈땫됫딁뒼돳땥뎠뒻뒋땭돝돳땀뒻뒀땲딟뎨드뎬돠뒻땰땭땲땜땪땔뒋뒤든땪땣땟됴땋뒨됩돝땮땬든돳딤땄뒛둔딌딠됨딅땃듟둑둡될땮돛된뒾땪드돠뒵둔땪둠둣딁땥땟둔땥딄땳돸듟딟뒈땍둑둑뎨땭땡된딞듽뒈됫땲뒬땤뒘득둔;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:J

    .line 5
    .line 6
    return-void
.end method
