.class public final L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Lkotlin/ranges/OpenEndRange;


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

.field public final 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D


# direct methods
.method public constructor <init>(DD)V
    .locals 0

    .line 1
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 2
    .line 3
    .line 4
    iput-wide p1, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 5
    .line 6
    iput-wide p3, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 7
    .line 8
    return-void
.end method


# virtual methods
.method public final contains(Ljava/lang/Comparable;)Z
    .locals 4

    .line 1
    check-cast p1, Ljava/lang/Number;

    .line 2
    .line 3
    invoke-virtual {p1}, Ljava/lang/Number;->doubleValue()D

    .line 4
    .line 5
    .line 6
    move-result-wide v0

    .line 7
    iget-wide v2, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 8
    .line 9
    cmpl-double p1, v0, v2

    .line 10
    .line 11
    if-ltz p1, :cond_0

    .line 12
    .line 13
    iget-wide v2, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 14
    .line 15
    cmpg-double p1, v0, v2

    .line 16
    .line 17
    if-gez p1, :cond_0

    .line 18
    .line 19
    const/4 p1, 0x1

    .line 20
    goto :goto_0

    .line 21
    :cond_0
    const/4 p1, 0x0

    .line 22
    :goto_0
    return p1
.end method

.method public final equals(Ljava/lang/Object;)Z
    .locals 5

    .line 1
    instance-of v0, p1, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;

    .line 2
    .line 3
    if-eqz v0, :cond_2

    .line 4
    .line 5
    invoke-virtual {p0}, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->isEmpty()Z

    .line 6
    .line 7
    .line 8
    move-result v0

    .line 9
    if-eqz v0, :cond_0

    .line 10
    .line 11
    move-object v0, p1

    .line 12
    check-cast v0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;

    .line 13
    .line 14
    invoke-virtual {v0}, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->isEmpty()Z

    .line 15
    .line 16
    .line 17
    move-result v0

    .line 18
    if-nez v0, :cond_1

    .line 19
    .line 20
    :cond_0
    check-cast p1, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;

    .line 21
    .line 22
    iget-wide v0, p1, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 23
    .line 24
    iget-wide v2, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 25
    .line 26
    cmpg-double v4, v2, v0

    .line 27
    .line 28
    if-nez v4, :cond_2

    .line 29
    .line 30
    iget-wide v0, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 31
    .line 32
    iget-wide v2, p1, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 33
    .line 34
    cmpg-double p1, v0, v2

    .line 35
    .line 36
    if-nez p1, :cond_2

    .line 37
    .line 38
    :cond_1
    const/4 p1, 0x1

    .line 39
    goto :goto_0

    .line 40
    :cond_2
    const/4 p1, 0x0

    .line 41
    :goto_0
    return p1
.end method

.method public final getEndExclusive()Ljava/lang/Comparable;
    .locals 2

    .line 1
    iget-wide v0, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 2
    .line 3
    invoke-static {v0, v1}, Ljava/lang/Double;->valueOf(D)Ljava/lang/Double;

    .line 4
    .line 5
    .line 6
    move-result-object v0

    .line 7
    return-object v0
.end method

.method public final getStart()Ljava/lang/Comparable;
    .locals 2

    .line 1
    iget-wide v0, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 2
    .line 3
    invoke-static {v0, v1}, Ljava/lang/Double;->valueOf(D)Ljava/lang/Double;

    .line 4
    .line 5
    .line 6
    move-result-object v0

    .line 7
    return-object v0
.end method

.method public final hashCode()I
    .locals 7

    .line 1
    invoke-virtual {p0}, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->isEmpty()Z

    .line 2
    .line 3
    .line 4
    move-result v0

    .line 5
    if-eqz v0, :cond_0

    .line 6
    .line 7
    const/4 v0, -0x1

    .line 8
    goto :goto_0

    .line 9
    :cond_0
    iget-wide v0, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 10
    .line 11
    invoke-static {v0, v1}, Ljava/lang/Double;->doubleToLongBits(D)J

    .line 12
    .line 13
    .line 14
    move-result-wide v0

    .line 15
    const/16 v2, 0x20

    .line 16
    .line 17
    ushr-long v3, v0, v2

    .line 18
    .line 19
    xor-long/2addr v0, v3

    .line 20
    long-to-int v1, v0

    .line 21
    mul-int/lit8 v1, v1, 0x1f

    .line 22
    .line 23
    iget-wide v3, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 24
    .line 25
    invoke-static {v3, v4}, Ljava/lang/Double;->doubleToLongBits(D)J

    .line 26
    .line 27
    .line 28
    move-result-wide v3

    .line 29
    ushr-long v5, v3, v2

    .line 30
    .line 31
    xor-long v2, v3, v5

    .line 32
    .line 33
    long-to-int v0, v2

    .line 34
    add-int/2addr v0, v1

    .line 35
    :goto_0
    return v0
.end method

.method public final isEmpty()Z
    .locals 5

    .line 1
    iget-wide v0, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 2
    .line 3
    iget-wide v2, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 4
    .line 5
    cmpg-double v4, v0, v2

    .line 6
    .line 7
    if-ltz v4, :cond_0

    .line 8
    .line 9
    const/4 v0, 0x1

    .line 10
    goto :goto_0

    .line 11
    :cond_0
    const/4 v0, 0x0

    .line 12
    :goto_0
    return v0
.end method

.method public final toString()Ljava/lang/String;
    .locals 3

    .line 1
    new-instance v0, Ljava/lang/StringBuilder;

    .line 2
    .line 3
    invoke-direct {v0}, Ljava/lang/StringBuilder;-><init>()V

    .line 4
    .line 5
    .line 6
    iget-wide v1, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:D

    .line 7
    .line 8
    invoke-virtual {v0, v1, v2}, Ljava/lang/StringBuilder;->append(D)Ljava/lang/StringBuilder;

    .line 9
    .line 10
    .line 11
    const-string v1, "..<"

    .line 12
    .line 13
    invoke-virtual {v0, v1}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;

    .line 14
    .line 15
    .line 16
    iget-wide v1, p0, L딤땫뎨땃듽땤땮뎠뒀땬될땃듌드둑뒾땐땄땅뒻땟두뒹딎듰돝땥듔땋땄땝딤돤돳뒉딸뒵둑돷될딟땮딃듽돰듟득딻땤뎽딄들딐땨땄땵돨들딜돰돝됨뒤딨땐듼돳돵땠돳땳뒷뎻뒾돷딨뒷따따뎡둔득딜땤딞딁든듽둑땸땜땹땳딜둔땡땀땜땵땳됫땧돠땅돵돠딅딝돨듨딹듐뒨땥땣돝뒉딄딤뎽든뎰듔땯들딌딟땣뒛돰;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:D

    .line 17
    .line 18
    invoke-virtual {v0, v1, v2}, Ljava/lang/StringBuilder;->append(D)Ljava/lang/StringBuilder;

    .line 19
    .line 20
    .line 21
    invoke-virtual {v0}, Ljava/lang/StringBuilder;->toString()Ljava/lang/String;

    .line 22
    .line 23
    .line 24
    move-result-object v0

    .line 25
    return-object v0
.end method
