.class public final synthetic L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Landroid/content/DialogInterface$OnClickListener;


# instance fields
.field public final synthetic 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

.field public final synthetic 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/activities/SshActivity;

.field public final synthetic 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Landroidx/appcompat/app/AlertDialog$Builder;


# direct methods
.method public synthetic constructor <init>(Lcom/tknetwork/tunnel/activities/SshActivity;Landroidx/appcompat/app/AlertDialog$Builder;I)V
    .locals 0

    .line 1
    iput p3, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    iput-object p1, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/activities/SshActivity;

    iput-object p2, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Landroidx/appcompat/app/AlertDialog$Builder;

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    return-void
.end method


# virtual methods
.method public final onClick(Landroid/content/DialogInterface;I)V
    .locals 2

    .line 1
    iget v0, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    packed-switch v0, :pswitch_data_0

    iget-object v0, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Landroidx/appcompat/app/AlertDialog$Builder;

    iget-object v1, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/activities/SshActivity;

    invoke-static {v1, v0, p1, p2}, Lcom/tknetwork/tunnel/activities/SshActivity;->뎨땱듼딃든둔뒬뒨땣된둬딻땵딎딽디땋따땃뒷딐땁된땀땔듨땤둠돠뎽땤돷듽둡돛딨듻뒋딐둣듌뒵듐둑뒾됫듟딌딤될뒨둥듟땬땁뒼땄돴뒙디딐딜들둣땧듬땐딌됨딹땸뒘땪뒝뒻딀땬땡딤듟딁따들돤땝뒼뒙딌딜딨뎹땀딌뎠득땝땔땅돠돛둬뒬뒻돨둡돠땋땯돝돵땔둘됴뒹땲땻땤듬뎬뎡돶땸돳듰땭뒐땪둔듔땬(Lcom/tknetwork/tunnel/activities/SshActivity;Landroidx/appcompat/app/AlertDialog$Builder;Landroid/content/DialogInterface;I)V

    return-void

    :pswitch_0
    iget-object v0, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:Landroidx/appcompat/app/AlertDialog$Builder;

    iget-object v1, p0, L땠따듬딤땃땲딽돸땍딅땵딤땧됨도둥땥땡뎰뒈땝땳땤딄둠듨땡둠뒋땱딠둠뒋땭뒘듽돵뎰돛땤듽뒉됐땃딻땬돴득땱뎠뒐뒛따뒻들뒾딝딽딎둔돛뎨땡듸뒻딝뒀땫딁뎬듌땫딻둬딨딌땤땐뒈뒋땮든땩돴뎻뎸땃돤땮딹땧땠따땮땭듐된듼듐득듌땍땭땠듔땬둔듐뒵뎬뒛뎡듼뒙드땨땱땁땸둠땝딐땪땵딜듬듨돶땮디;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Lcom/tknetwork/tunnel/activities/SshActivity;

    invoke-static {v1, v0, p1, p2}, Lcom/tknetwork/tunnel/activities/SshActivity;->뎬돨둬듟듰뒤뒻딐둥둥땅둑뒵디뎹땟땰땳돶듬됩뒨득뎰든뒈돸뒬땦땧땮딅딃땝돼돷땰둘된돝뒬돨땁도듸됐땪땻뒉딌뒤둘뒐뒀땹뒷돵듌될땤듻땠돳뒻땡됫듌딎땍딝둠땰땩땃돛딝딎득돸땬돸디돼땝땣듌딌딐돷될둔땋둬듐듐듨뒙딀뒈땸된딤딸뒼뒝뒈딽땮땐든땻땠땠둘도땜뒻둣땤딤딟듸돴듨딌딞딜뎡된땅(Lcom/tknetwork/tunnel/activities/SshActivity;Landroidx/appcompat/app/AlertDialog$Builder;Landroid/content/DialogInterface;I)V

    return-void

    nop

    :pswitch_data_0
    .packed-switch 0x0
        :pswitch_0
    .end packed-switch
.end method
