.class public final L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Ljava/util/Iterator;
.implements Lkotlin/jvm/internal/markers/KMappedMarker;


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:J

.field public 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

.field public final 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

.field public 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:J


# direct methods
.method public constructor <init>(JJJ)V
    .locals 7

    .line 1
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 2
    .line 3
    .line 4
    iput-wide p3, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:J

    .line 5
    .line 6
    const-wide/16 v0, 0x0

    .line 7
    .line 8
    const/4 v2, 0x0

    .line 9
    const/4 v3, 0x1

    .line 10
    const-wide/high16 v4, -0x8000000000000000L

    .line 11
    .line 12
    cmp-long v6, p5, v0

    .line 13
    .line 14
    if-lez v6, :cond_0

    .line 15
    .line 16
    xor-long v0, p1, v4

    .line 17
    .line 18
    xor-long/2addr v4, p3

    .line 19
    invoke-static {v0, v1, v4, v5}, Ljava/lang/Long;->compare(JJ)I

    .line 20
    .line 21
    .line 22
    move-result v0

    .line 23
    if-gtz v0, :cond_1

    .line 24
    .line 25
    :goto_0
    const/4 v2, 0x1

    .line 26
    goto :goto_1

    .line 27
    :cond_0
    xor-long v0, p1, v4

    .line 28
    .line 29
    xor-long/2addr v4, p3

    .line 30
    invoke-static {v0, v1, v4, v5}, Ljava/lang/Long;->compare(JJ)I

    .line 31
    .line 32
    .line 33
    move-result v0

    .line 34
    if-ltz v0, :cond_1

    .line 35
    .line 36
    goto :goto_0

    .line 37
    :cond_1
    :goto_1
    iput-boolean v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 38
    .line 39
    invoke-static {p5, p6}, Lkotlin/ULong;->constructor-impl(J)J

    .line 40
    .line 41
    .line 42
    move-result-wide p5

    .line 43
    iput-wide p5, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    .line 44
    .line 45
    iget-boolean p5, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 46
    .line 47
    if-eqz p5, :cond_2

    .line 48
    .line 49
    goto :goto_2

    .line 50
    :cond_2
    move-wide p1, p3

    .line 51
    :goto_2
    iput-wide p1, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:J

    .line 52
    .line 53
    return-void
.end method


# virtual methods
.method public final hasNext()Z
    .locals 1

    .line 1
    iget-boolean v0, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 2
    .line 3
    return v0
.end method

.method public final next()Ljava/lang/Object;
    .locals 5

    .line 1
    iget-wide v0, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:J

    .line 2
    .line 3
    iget-wide v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:J

    .line 4
    .line 5
    cmp-long v4, v0, v2

    .line 6
    .line 7
    if-nez v4, :cond_1

    .line 8
    .line 9
    iget-boolean v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 10
    .line 11
    if-eqz v2, :cond_0

    .line 12
    .line 13
    const/4 v2, 0x0

    .line 14
    iput-boolean v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 15
    .line 16
    goto :goto_0

    .line 17
    :cond_0
    new-instance v0, Ljava/util/NoSuchElementException;

    .line 18
    .line 19
    invoke-direct {v0}, Ljava/util/NoSuchElementException;-><init>()V

    .line 20
    .line 21
    .line 22
    throw v0

    .line 23
    :cond_1
    iget-wide v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    .line 24
    .line 25
    add-long/2addr v2, v0

    .line 26
    invoke-static {v2, v3}, Lkotlin/ULong;->constructor-impl(J)J

    .line 27
    .line 28
    .line 29
    move-result-wide v2

    .line 30
    iput-wide v2, p0, L땮땡디뒻돷뒹뒷땣땳딅딎땨듽둘둬딝뒵돛땤뒵땫둘땵듌딤돶둡듰뎰됩뒹듔뒐돶돵뒐뒾디땫듰뒬땹뎡두땤딻듰돳딨뒝되땃딝땮돶딞땃땮땟듽돨된딅들뒋딄뒉땳뒤돼뒻땔딐땍됩뎡딹땤돼뎨땧땅땫됨뎬딀땣뎨땰땸땨딹두돨둔됨뎡딎둬뎨땝뎡땡땐들득딃돶됴돠땫뒐듸땝딎땩뒀됨딹땫땳뎹땐땀땭두뎰뒼뒈뒉;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:J

    .line 31
    .line 32
    :goto_0
    invoke-static {v0, v1}, Lkotlin/ULong;->box-impl(J)Lkotlin/ULong;

    .line 33
    .line 34
    .line 35
    move-result-object v0

    .line 36
    return-object v0
.end method

.method public final remove()V
    .locals 2

    .line 1
    new-instance v0, Ljava/lang/UnsupportedOperationException;

    .line 2
    .line 3
    const-string v1, "Operation is not supported for read-only collection"

    .line 4
    .line 5
    invoke-direct {v0, v1}, Ljava/lang/UnsupportedOperationException;-><init>(Ljava/lang/String;)V

    .line 6
    .line 7
    .line 8
    throw v0
.end method
