.class public final L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Ljava/util/Iterator;
.implements Lkotlin/jvm/internal/markers/KMappedMarker;


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

.field public 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

.field public final 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

.field public 뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I


# direct methods
.method public constructor <init>(III)V
    .locals 4

    .line 1
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 2
    .line 3
    .line 4
    iput p2, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    .line 5
    .line 6
    const/4 v0, 0x0

    .line 7
    const/4 v1, 0x1

    .line 8
    const/high16 v2, -0x80000000

    .line 9
    .line 10
    if-lez p3, :cond_0

    .line 11
    .line 12
    xor-int v3, p1, v2

    .line 13
    .line 14
    xor-int/2addr v2, p2

    .line 15
    invoke-static {v3, v2}, Ljava/lang/Integer;->compare(II)I

    .line 16
    .line 17
    .line 18
    move-result v2

    .line 19
    if-gtz v2, :cond_1

    .line 20
    .line 21
    :goto_0
    const/4 v0, 0x1

    .line 22
    goto :goto_1

    .line 23
    :cond_0
    xor-int v3, p1, v2

    .line 24
    .line 25
    xor-int/2addr v2, p2

    .line 26
    invoke-static {v3, v2}, Ljava/lang/Integer;->compare(II)I

    .line 27
    .line 28
    .line 29
    move-result v2

    .line 30
    if-ltz v2, :cond_1

    .line 31
    .line 32
    goto :goto_0

    .line 33
    :cond_1
    :goto_1
    iput-boolean v0, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 34
    .line 35
    invoke-static {p3}, Lkotlin/UInt;->constructor-impl(I)I

    .line 36
    .line 37
    .line 38
    move-result p3

    .line 39
    iput p3, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

    .line 40
    .line 41
    iget-boolean p3, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 42
    .line 43
    if-eqz p3, :cond_2

    .line 44
    .line 45
    goto :goto_2

    .line 46
    :cond_2
    move p1, p2

    .line 47
    :goto_2
    iput p1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

    .line 48
    .line 49
    return-void
.end method


# virtual methods
.method public final hasNext()Z
    .locals 1

    .line 1
    iget-boolean v0, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 2
    .line 3
    return v0
.end method

.method public final next()Ljava/lang/Object;
    .locals 2

    .line 1
    iget v0, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

    .line 2
    .line 3
    iget v1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    .line 4
    .line 5
    if-ne v0, v1, :cond_1

    .line 6
    .line 7
    iget-boolean v1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 8
    .line 9
    if-eqz v1, :cond_0

    .line 10
    .line 11
    const/4 v1, 0x0

    .line 12
    iput-boolean v1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Z

    .line 13
    .line 14
    goto :goto_0

    .line 15
    :cond_0
    new-instance v0, Ljava/util/NoSuchElementException;

    .line 16
    .line 17
    invoke-direct {v0}, Ljava/util/NoSuchElementException;-><init>()V

    .line 18
    .line 19
    .line 20
    throw v0

    .line 21
    :cond_1
    iget v1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:I

    .line 22
    .line 23
    add-int/2addr v1, v0

    .line 24
    invoke-static {v1}, Lkotlin/UInt;->constructor-impl(I)I

    .line 25
    .line 26
    .line 27
    move-result v1

    .line 28
    iput v1, p0, L땮땃뎰딻뎻돷둘땸듰땟뒤뒐딟딜듼될뒋듌땄뎬딁뒷뒋뒘땵딎뒼땣땅듼들땀듽돶될땀뒻땋듼뎸드되돤땯땳돨딞딤땥듔딞따뒋땻되땮돶돵딐두뎠땩된땦따땳뒝둬둡뒵뒨듬둠됩뎬딨돷돤딽둬뒵땻땭땟됨뎽딄뎰돶땭뎽드듐땧뒙땨돼땀뒷뒼뒛뒬땻땪땲딨땪땻땋둠둑들둔된뒻도땐둘뎡땧됴뒵돸땦듽듻딝디땄땃;->뎠땻땝뎹딽두딽둠땅땫땵뒈뒾땍뒤되뒵둠땯됫둡땁도뎹뎠땦뎽듽뒛땄땤딃돶땩딝딎듸딅뎬둑땀땝딻두뒘뒛돵땋듼둘듼땄딄돛딎딄돴딐뒐딝돠뎰땃뒘돸딨땟딐됨뒬둔땬따땹뎹뎽딽돼딤땠땣뒤됴됨든땵땻뒀뒝돰돸듬땮뎠뒀돷돵땍듐디듐듻땩득듻돴딜땋뒛땸돸딁딁땜땰땨땫뒼땔뒼둬됴땸뒋둬땥딠뒾땪됨:I

    .line 29
    .line 30
    :goto_0
    invoke-static {v0}, Lkotlin/UInt;->box-impl(I)Lkotlin/UInt;

    .line 31
    .line 32
    .line 33
    move-result-object v0

    .line 34
    return-object v0
.end method

.method public final remove()V
    .locals 2

    .line 1
    new-instance v0, Ljava/lang/UnsupportedOperationException;

    .line 2
    .line 3
    const-string v1, "Operation is not supported for read-only collection"

    .line 4
    .line 5
    invoke-direct {v0, v1}, Ljava/lang/UnsupportedOperationException;-><init>(Ljava/lang/String;)V

    .line 6
    .line 7
    .line 8
    throw v0
.end method
