.class public final synthetic L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Ljava/lang/Runnable;


# instance fields
.field public final synthetic 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

.field public final synthetic 뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Ljava/lang/Object;

.field public final synthetic 뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J


# direct methods
.method public synthetic constructor <init>(Ljava/lang/Object;JI)V
    .locals 0

    .line 1
    iput p4, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    iput-object p1, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Ljava/lang/Object;

    iput-wide p2, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    return-void
.end method


# virtual methods
.method public final run()V
    .locals 3

    .line 1
    iget v0, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:I

    packed-switch v0, :pswitch_data_0

    iget-object v0, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Ljava/lang/Object;

    check-cast v0, Lcom/tknetwork/tunnel/activities/ActivityUi;

    iget-wide v1, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    invoke-static {v0, v1, v2}, Lcom/tknetwork/tunnel/activities/ActivityUi;->뎸딞돵뎡뎬땃뒵딸돵땱둘뒹득뒛땩뒵뒾듸듟딅땫돝돛땔뒵땱둡딁땔되땄듔뒷딠땐듬뎬땱딀딄땰둘땡땡됩뒹돵뒈땥딽뒉땬땧딽둔듔뒀땠딨딜땭뒻돠딜땤도둬된땭됐드도땔땦땻디됨돰뒼땟듻뎬뎡뎽땍뒬딠뎬땦두뒛돴돴둑됫드둣든땥디땧됩됨두딠딨땃둠돵뎸뒨뎸뎹땡뒙땨딝되땁됨돼땲돼뎽땮땠딄딁땄땸(Lcom/tknetwork/tunnel/activities/ActivityUi;J)V

    return-void

    :pswitch_0
    iget-object v0, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Ljava/lang/Object;

    check-cast v0, Landroidx/camera/video/internal/encoder/EncoderImpl;

    iget-wide v1, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    invoke-static {v0, v1, v2}, Landroidx/camera/video/internal/encoder/EncoderImpl;->뎡디돳듬딁됫땥뒾땥딌딨따땍뒛땐든딜뒋돵돷땹뒘땦됐땔딄둘땯땧두땔땭된돵뒾뒹땟딠땪뒹도뒐돤돵듌땦둠돵돴땫둥듔듻딄딽뎠뎸땀땱득땯뎰두뒹디땅들뒀뒙딽뎡됫딞뒻듟딠뒾뒛딟듬득땬딌돨땳뒼딅뒷듰듽돶두뎨돰뎬돨딞뒐뒹딃드딁듌땫뒝땹땧됩땜딻됨땡드딐딨돤딌땨뒈뒼따딽뒹뎰딐뒷뒝딟땲뒨(Landroidx/camera/video/internal/encoder/EncoderImpl;J)V

    return-void

    :pswitch_1
    iget-object v0, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠딎딃듼뒉됨뎹땨듻땀딝땦뒬돰돷땩득딞든둣듼돸됐땃둠딜딸뒵들돴듰땃득땋뎠돸딤땀딝뎹딨두땨뒷딎딎딐뒀뎬듰딜땭듔듨돴듼둥득뎹돶들드뎻딁둘됐돨둠뒈땅돨땜딝들딀둑뒹뎹두땬듐돶듬땬도뎸둠둠뒨됐땝딎딀땸땪득뒵땬뒐땰땝뒵땲듬듽돵뒀땋뒬땳뒋듰땟돰되땋둔땱듔땀땣되뒘돼뒻딁둥뒘된땫:Ljava/lang/Object;

    check-cast v0, Landroidx/camera/video/internal/encoder/EncoderImpl;

    iget-wide v1, p0, L뒛돠뒵듟딀듻듸뒨딄땰딅둬땲딽딞땹돶됫땣땤듻둣뎰땵땳듰드돵든땍득뎡땳뒵돴딃듌땧땩뒛돤땮땡뎠땮둬뎽듌뎡돳듰돰뒐땤땯됐땠둘돷뒙땃됩뎻뒘딹듼돠듸됨딃됴듐듐됨뒘땡땮돛둘듌뎽딁듟땪둑땝돝땳듟돠도뒻땻땡땮딄땤도둡땍됩둑뒉땋뎨듼땬든땟땱딁땤됨땥듽딁딞뒀뒷딐돤뎰땱딤됫듬딨듨딜땣;->뎠땄뒐돸듌돛뒐뒀듸딐딃땁듔뎡듌딀둬뒀되땳땳뒤뒼둠땮땄땤두땍뎻땧딻도듼뒬땡뒀듻딠돷뎸둑돵둬딹땐됫땅뎡딟될땯땔땋딟땳딃돳뒝디뒨듟돶딜땳딟땄뒀돝땮도도딄땯듰땮뎡뎡듟듻땄뒀뒻땭둑듨들들땸듟되둬뒝돰듔됩딨듌딜듻돝드뒾둑뎡듰땅딃딤땅뒨뒈뒹될듸돵둘뒐땭땁듸땮뒉땪딟든땻땱듻뒉:J

    invoke-static {v0, v1, v2}, Landroidx/camera/video/internal/encoder/EncoderImpl;->뎨됫땔땵땃돳듰땩됐뎰둥된돴딻딟땥딀둥뒤땁뎰땦땦될땮드딎땄뎻땨땣돝땔드뒹딀뎻뎬땫디땦땮땡둥딤딎됴딠뒵땬딸뒷딁둬듌땝땀땄땄딸듐땵둔딸딜뎨뎻뒀딨둥듸뎹됐딹땳땡듰득뎹두딝뒛땹돼뒷땐돤뒾듨둡땀딃땭땀돨뎬딃뎨땝돵딀됩뎰뒹땠뒷딅딝뎨뎠뎹딹딃돴뎡딄돸듬딃둠돶득뒝땔뎽땠딁됨뒬딻(Landroidx/camera/video/internal/encoder/EncoderImpl;J)V

    return-void

    nop

    :pswitch_data_0
    .packed-switch 0x0
        :pswitch_1
        :pswitch_0
    .end packed-switch
.end method
