.class public final L듽딝둡됩뒷뎰뎻땥땰뒵땍돤뒤땍땝딝뒀땮따땡딞둬뎠듐땰땋돤땸땝돛뎹뒀뒵둣뎬뒾딁듐됴땧됩됐딽딟둑땤딽뒹든둑도땻돛듔땻딐둥돠딃딅딽땻땡뎡딌뒬듸땧딨땋됨뎸땝뒀딻땠두되든듬땸뎠드될듻땡딄둘땪뒉딌듐둔둠딌듟둬됨딐딄땯딄될듸뒉딄땻땰땬딽땧땔됐뎬뎡땸뎬땦뒘뒈뒨땡땃돰돳두땡딨딃된;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Lcoil3/util/HardwareBitmapService;


# instance fields
.field public final 뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Z


# direct methods
.method public constructor <init>(Z)V
    .locals 0

    .line 1
    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    .line 2
    .line 3
    .line 4
    iput-boolean p1, p0, L듽딝둡됩뒷뎰뎻땥땰뒵땍돤뒤땍땝딝뒀땮따땡딞둬뎠듐땰땋돤땸땝돛뎹뒀뒵둣뎬뒾딁듐됴땧됩됐딽딟둑땤딽뒹든둑도땻돛듔땻딐둥돠딃딅딽땻땡뎡딌뒬듸땧딨땋됨뎸땝뒀딻땠두되든듬땸뎠드될듻땡딄둘땪뒉딌듐둔둠딌듟둬됨딐딄땯딄될듸뒉딄땻땰땬딽땧땔됐뎬뎡땸뎬땦뒘뒈뒨땡땃돰돳두땡딨딃된;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Z

    .line 5
    .line 6
    return-void
.end method


# virtual methods
.method public final allowHardwareMainThread(Lcoil3/size/Size;)Z
    .locals 0

    .line 1
    iget-boolean p1, p0, L듽딝둡됩뒷뎰뎻땥땰뒵땍돤뒤땍땝딝뒀땮따땡딞둬뎠듐땰땋돤땸땝돛뎹뒀뒵둣뎬뒾딁듐됴땧됩됐딽딟둑땤딽뒹든둑도땻돛듔땻딐둥돠딃딅딽땻땡뎡딌뒬듸땧딨땋됨뎸땝뒀딻땠두되든듬땸뎠드될듻땡딄둘땪뒉딌듐둔둠딌듟둬됨딐딄땯딄될듸뒉딄땻땰땬딽땧땔됐뎬뎡땸뎬땦뒘뒈뒨땡땃돰돳두땡딨딃된;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Z

    .line 2
    .line 3
    return p1
.end method

.method public final allowHardwareWorkerThread()Z
    .locals 1

    .line 1
    iget-boolean v0, p0, L듽딝둡됩뒷뎰뎻땥땰뒵땍돤뒤땍땝딝뒀땮따땡딞둬뎠듐땰땋돤땸땝돛뎹뒀뒵둣뎬뒾딁듐됴땧됩됐딽딟둑땤딽뒹든둑도땻돛듔땻딐둥돠딃딅딽땻땡뎡딌뒬듸땧딨땋됨뎸땝뒀딻땠두되든듬땸뎠드될듻땡딄둘땪뒉딌듐둔둠딌듟둬됨딐딄땯딄될듸뒉딄땻땰땬딽땧땔됐뎬뎡땸뎬땦뒘뒈뒨땡땃돰돳두땡딨딃된;->뎠둠땪듼뎠딅땲둔듽됫딞돰둡딞듼뎨뎨듔땡딝땨땃땀뒻딤딹돝되땳땲딸뒾뎨땱땥돶뒛뒷들뒨땋돠뎡둔된돤든됫딹돳돴돛땍땸뒵둑돳땨땝득땮땠땨딀딄뒨뒀땀땋듽됫딹땵딨뒵듸땵뎬뒻돤땨두듰땫땻뒋돶두땣뎡뎡듐땫땰뒉뎹땩땱둑딄돳듸뒤뎻땮딜땻됨뎸뒼딃됫돸땮땮돨뒨땡땲딨돷되땋둘돠땪뒷뒙땅뎸:Z

    .line 2
    .line 3
    return v0
.end method
